/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   minirt.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zkerriga <zkerriga@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/06/17 16:36:27 by zkerriga          #+#    #+#             */
/*   Updated: 2020/06/17 16:38:17 by zkerriga         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minirt.h"

int	main(int ac, char **av)
{
	int		x;
	int		y;
	t_scene	*scene;

	if (ac == 2)
	scene = parser(av[1]);
	//Установить точку отчёта камеры
	y = 0;
	while (y < Field.size.y)
	{
		x = 0;
		while (x < Field.size.x)
		{
			//преобразование координат для вывода в окно
			//color = Trace ray - определить цвет пикселя по x,y
			//раскрасить пиксель в массиве окна.йй
		}
	}
	return (0);
}
